{"meta":{"title":"阿告的窝","subtitle":"","description":"Bravo!","author":"阿告今天学习了吗","url":"https://jiahaofang.github.io","root":"/"},"pages":[{"title":"","date":"2025-04-01T01:56:25.980Z","updated":"2025-04-01T01:56:25.980Z","comments":true,"path":"404.html","permalink":"https://jiahaofang.github.io/404.html","excerpt":"","text":""},{"title":"categories","date":"2022-02-22T03:29:09.000Z","updated":"2025-04-01T01:56:25.983Z","comments":true,"path":"categories/index.html","permalink":"https://jiahaofang.github.io/categories/index.html","excerpt":"","text":""},{"title":"关于","date":"2025-04-01T01:56:25.983Z","updated":"2025-04-01T01:56:25.983Z","comments":true,"path":"about/index.html","permalink":"https://jiahaofang.github.io/about/index.html","excerpt":"","text":"About me"},{"title":"tags","date":"2014-12-22T04:39:04.000Z","updated":"2025-04-01T01:56:25.983Z","comments":true,"path":"tags/index.html","permalink":"https://jiahaofang.github.io/tags/index.html","excerpt":"","text":""}],"posts":[{"title":"test2","slug":"test2","date":"2025-04-01T03:41:00.000Z","updated":"2025-04-01T03:44:00.000Z","comments":true,"path":"test2/","link":"","permalink":"https://jiahaofang.github.io/test2/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"","slug":"general_psychology","date":"2025-04-01T01:56:25.981Z","updated":"2025-04-01T01:56:25.981Z","comments":true,"path":"general_psychology/","link":"","permalink":"https://jiahaofang.github.io/general_psychology/","excerpt":"[TOC]","text":"[TOC] 普通心理学 source: BV1Fy4y1i79C 参考教材 《普通心理学》第4版 彭聃龄，北京师范大学出版社 《津巴多普通心理学》菲利普·津巴多，中国人民大学出版社 推荐书目 《心理学与生活》菲利普·津巴多，人民邮电出版 《心理学的故事》墨顿·亨特 李斯，海南出版社 《改变心理学的40项研究》 白学军，中国轻工业出版社 《登天的感觉》——以案例的方式讲心理咨询 心理学的研究对象、方法 心理学研究什么？心理现象 + 行为 心理学更多从个体角度研究心理（个体心理） 心理现象 人脑对现实生活的主观反应 什么方面、角度研究心理现象？个体的角度——个体心理 / 个人受别人影响的角度——社会心理。 个体心理 认知——信息加工系统 获得知识、应用知识的过程，接收信息、信息加工、支配行为 感觉、知觉、注意、记忆、思维、语言 动机和情绪——心理和行为调节与控制的系统 目的、为什么 上面两者强调心理共性的研究 能力和人格——心理特性系统 强调个体差异 社会心理 研究个体与他人互动时产生的心理现象 社会促进现象：由于他人在场促进了个体竞争动机的现象 社会堕化现象：群体在一起的时候，个人付出的努力比单独完成时偏少的现象 旁观者效应：吉诺维斯案件 -&gt; 责任分散 从众心理：哄抢葡萄（坏的）；选择人多的餐厅吃饭（好的） 去个性化：个体淹没到群体当中，自我责任感丧失 研究人的思想、情感和行为，怎样受到真实或想象的他人存在的影响 社会知觉 人际吸引 行为 在主客观因素下可以观察到的外部活动 联系 心理支配行为 行为反推心理 现代心理学的门类 理论心理学：发展*，学习*，认知*，人格*，社会*，变态*，生理*，实验*，比较*（动物*）等 应用心理学：教育*，咨询*，临床*，犯罪*，工业*（包括管理*，工程*），医学*，广告*，健康*，心理测量学等 心理学研究的目标 描述：描述这种现象是什么 解释：为什么会出现这种现象 预测：做出预测 控制：控制心理和行为 心理学的应用 心理学的研究方法 原则：客观、实事求是 基本方法： 观察法 优点：保持心理的自然性，结果比较真实 缺点：结果有时候难以检验和证实；受研究者主观因素影响大，易产生观察者偏见；不能得出确切的因果关系 实验法：在控制的条件下，研究者有系统的操作自变量，然后观察自变量和因变量之间关系的一种方法 实验室实验 &amp; 自然实验 被试内设计 &amp; 被试间设计 常用因变量: 反应时RT 优点 容易解释事物的因果关系 可以重复、可检验 数量化指标明确 缺点 推广时难以保证有效性 心理测验法（量表） 智力测验、人格测验、职业能力倾向测验 文字测验、非文字测验（图形） 衡量测验的标准：信度——可靠程度、效度——是否有效地测量了你要测量的东西（心理测量学） 个案法 调查法 心理学的过去和现在 心理学史 19世纪末成为一门独立的科学 心理学有漫长的过去，但只有短暂的历史 现代心理学的诞生离不开近代哲学思潮和实验生理学的影响 19世纪末、20世纪初的西方心理学派别 构造主义学派（关注结构）：研究人的直接的经验，即意识（心理） 机能主义学派（关注功能） 研究意识或心理的作用和功能 意识不是个别元素的集合，是连续的整体，意识的功能在于使有机体适应环境 格式塔心理学派（关注整体）： 研究意识的科学 心理是一个整体，整体不等于部分之和，整体大于部分之和 行为主义学派（关注行为） 《行为主义的心理学》系统阐述了行为主义的理论体系 1913年 - 20世纪50年代 激进的行为主义：华生 研究外显的行为、决定行为的因素 行为是有机体适应环境的活动，引发活动的是刺激，心理学是研究刺激-反应的科学 个体行为的环境决定论（后天经验决定行为） 反对使用内省，使用实验的方式进行研究 新行为主义：斯金纳、托尔曼 承认内部心理活动对行为的作用， 承认S-R之间存在一个中间变量O-有机体 操作型条件反射（斯金纳，“斯金纳箱”） 学习即行为反应发生概率的变化（行为的结果影响行为）什么因素决定？——强化 &amp; 惩罚 正强化：行为在先，强化物在后 负强化：强化物（厌恶性刺激）在先，行为在后 两种惩罚：行为发生反应后，呈现厌恶的刺激 / 取消喜欢的刺激 精神分析学派（关注潜意识） 弗洛伊德1896年创立，现代心理学中影响最大的理论之一 性欲论：行为的动机来源于心灵深处的欲望，特别是性欲；性本能和死本能支配，人性恶 早期的人格结构理论：潜意识unconscious+前意识Preconscious+意识conscious 后期人格结构理论： 本我id（人格结构的底层，本能欲望、冲动组成的能量系统，追求满足、快乐的原则） 自我ego（中间层，调节本我超我的矛盾。现实的原则） 超我superego（抑制本我的冲动+对本我进行监控+追求完善的境界、道德的原则） 本我欲求 -&gt; 自我的决定和行为 &lt;- 超我限制 人格发展阶段的理论 研究方法：临床观察分析的方法 自由联想 释梦 评价：开辟了潜意识的研究，扩大心理学研究领域 当代心理学的研究取向 生理心理学 认知神经科学：脑功能成像的方法 ERP、PET、fMRI 认知心理学 强调认知过程的研究，认知因素在行为中的作用 用信息加工的观点研究认知的过程（输入加工存储输出） 记忆：编码、储存和提取的过程 采用实验、观察、计算机模拟等方法 人本主义心理学 心理学的第三势力（1精神分析、2行为主义、3人本主义） 强调研究健康人的心理 积极心理学 研究普通人的活力、力量与美德；促进个体的发展、社会的繁荣 心理的神经生理基础 神经系统的进化 脑是心理的器官，心理是人脑的功能（心理是脑对客观现实主观能动的反应） 心理是神经系统发展到一定阶段的产物，神经系统越进化，心理和行为越复杂，越高级 进化特点 脑重占体重的比例增加（脑指数） 皮层相对大小的变化 大脑皮层内部结构和功能的变化 结构上：其他动物新皮层容积小，人新皮层容积大 功能上：人脑功能更复杂 神经系统的结构和功能 神经元 中枢神经系统：脑和脊髓内的全部神经系统，加工整合信息，整合和调谐全身的功能 脊髓：将脑和周围神经系统联系起来的神经元干线 灰质：神经元胞体+神经元树突 白质：神经元轴突 脑干：延脑、桥脑、中脑；网状结构 小脑：与皮层运动区共同控制肌肉运动，协调身体的运动，控制身体的姿势 间脑： 丘脑：皮层下感觉中枢，除嗅觉外的各种感觉的中转站 下丘脑：调节植物性神经系统的皮下中枢 边缘系统：扣带回、海马（海马回、海马沟）、杏仁核等 大脑：表面的灰质（大脑皮层）+ 深度的白质；额叶颞叶顶叶枕叶 机体感觉区：顶叶中央后回 初级运动区：额叶中央前回 语言区：布洛卡区（语言表达）、威尔尼克区（理解口头语言）、角围（理解书面语言） 联合区：前额叶（注意、记忆、推理、问题解决、语言） 周围神经系统 脑的可塑性 在后天经验的作用下，脑的结构和功能等方面会发生一定程度的变化 脑功能学说 定位说：来源于颅相说，由颅骨的形状推知某种心理能力 整体说：脑的功能是由整体负责 三个机能系统学说：大脑皮层定位是动态的、系统机能定位 调节激活和维持觉醒状态的系统 信息接收、加工和储存的系统 行为调节系统 模块说： 人脑在结构和功能上是由高度专门化并相对独立的功能模块组成，不同功能模块不同，模块的结合保证着认知功能的完成 揭示人脑的整体特性 神经网络学说 各种心理活动是由不同脑区协同活动构成的神经网络实现 感觉 人脑对直接作用于感觉器官的事物的个别属性的认识 感觉的意义：提供了内外环境的信息，保持了机体与环境的信息平衡 差别感觉阈限与差别感受性 韦伯定律 对数定律：感觉的大小是刺激强度的对数函数 幂定律：数量估计法 视觉 不想学这一章了 知觉 也不想学这一章了 思维 思维的一般概念 含义 思维是借助语言、表象和动作实现的、对客观事物概括和间接的认识，是认识的高级形式 思维是在问题的空间中搜索的过程 特征 概括性：把一类事物共同的特征和概念抽取出来加以概括 间接性：借助一定的媒介和一定的知识经验对客观事物进行间接的认识 对经验的改组：思维是一种探索和发现新事物的过程，常指向新事物的特征和新关系。这需要人们对头脑中已有的知识经验不断进行更新和改组 种类 根据凭借物划分：直观动作思维、形象思维、逻辑思维 考虑问题是多角度还是单一角度：辅合思维、发散思维 发散思维的测量方法 流畅性：单位时间内发散项目的数量 变通性：发散项目的范围或纬度（触类旁通、举一反三） 独特性：能对问题提出超乎寻常的、独特新颖的见解 常规思维：运用已有的知识或经验，按现成的方案直接解决问题 创造性思维：重新组织已经有的知识经验、提出新的方案或程序 敏锐性、新颖性、独特性、具有重要的社会价值 表象与想象 表象 定义：当事物不在跟前时，头脑出现的关于事物的形象 种类：视觉表象、听觉表象、味觉表象、动作表象 特征：直观性、概括性（抽象性）、可操作性 表象在思维中的作用 表象是思维的单位之一，人们可以使用表象进行思维 有利于问题解决（举例子） 想象 对头脑中已有的表象进行加工改造，形成新的形象的过程；是种高级的认知活动 基本特点：形象性、新颖性 创造形象的方法： 黏合法：把现实中从来没有结合过的特征、属性黏合在一起创造出新的形象（八戒） 夸张法：改变客观事物的正常特点/突出某些特点（九头金乌） 典型化法：根据一类事物的共同特征创造新形象，阿Q 联想法：由一个事物联想到另一个事物 种类：无意想象、有意想象、再造想象、创造想象 作用 预见的作用，能预见活动的结果，指导人们活动进行的方向 创造性活动的组成部分 补充知识经验的作用 代替，某种需要得不到满足的时候用想象得到满足 调节生理活动，能改变人体外周部分的机能活动过程 概念与推理 概念 定义：具有共同属性的一类事物的总称 概念的内涵 &amp; 外延 概念与词的关系 概念用词来表达、巩固和记载，词是概念的语言形式，概念是词的思想内容 两者不是一一对应关系 概念的类型：合取概念、析取概念、关系概念 根据概念形成的自然性划分：自然概念、人工概念 概念结构的理论 层次网络模型：概念以节点形式储存在概念网络中——不一定具有心理现实性 特征表理论：概念由语义特征表征（定义性特征+特异性特征），概念结构由定义性特征和整合这些特征的规则决定 原型模型：从整体的角度来解释概念的结构 概念的形成是一个过程，概念的形成也叫概念的掌握 假设检验 样例学习 推理 从具体事物归纳出一般规律（归纳推理），或者根据一般原理推出新结论的思维活动（演绎推理） 逻辑学与心理学研究推理的区别 导致推理错误的原因 前提气氛效应、换位理论、心理模型 问题解决 不想学这一章了 情绪和情感 概述 情绪情感是人对客观事物的态度体验和相应的行为反应，包括 是主观的一种态度体验 是大脑的一种感受状态，只有自己才能感受到 情绪的体验可以积累，达到一定程度就会爆发 伴随身体的能量变化 女性的情绪体验比男性强，更容易识别面目的情绪表现，并更公开表现出来 生理唤醒 是生理的激活水平，不同的情绪情感的生理反应不同 生理变化不是人为有意识可以控制的，是由植物性神经系统控制的 外部表现 面部表情、姿态表情、语调表情（体语） 人在特定情绪状态下表现出一定的情绪反应 人类表情是先天和后天的统一体（先天+后天习得，具有适应环境的意义） 情绪和情感的区别和联系 原来人们把区别于认知过程并同特定的愿望和需要联系起来的主观体验统称为感情 区别 情绪指感情活动的过程；情感指某种体验和感受，常用来描述稳定的有社会意义的感情 情绪有一定的情景性、激动性、暂时性；情感具有一定的深刻性、稳定性、持久性。 联系 稳定的情感在情绪基础上形成，并通过情绪表达出来 情绪离不开情感，情绪变化反应情感的深度 功能 适应功能 动机功能 组织功能：情绪对其他心理活动可能起促进作用或瓦解作用 信号功能：通过人的表情，可以了解情绪状态，具有传递信息、沟通思想的作用 影响身心健康 情绪情感的分类 基本情绪 &amp; 复合情绪 积极情绪 &amp; 消极情绪 抑郁症的障碍 心境障碍，长时间内心境总不好，郁郁寡欢 思维方面对任何事物都持消极、悲观的认知 躯体功能方面，感觉到疼痛、疲倦 抑郁的原因：生理方面、后天环境、认知方面 情绪状态的分类 根据情绪持续时间的长短、情绪的强度，把情绪进行分类 心境：指比较平静的，持续时间比较长的状态，心境的情绪状态比较弱 心境具有一定的弥散性，当处于某种心境时，从事的其他活动也有心境的色彩 激情：强烈的、有爆发性的为时比较短暂的情绪状态 持续时间短、爆发力强 激情会引起生理、心理变化 会出现意识狭窄现象（认知活动的范围缩小、理智分析能力下降、自我控制能力减弱） 应激：人对某种意外的环境刺激的适应性反应 持续时间可长可短，压力可强可弱 在强烈的应激状态下会对人的生理和心理造成很大影响 人长期处于压力状态下，会造成适应性综合征 适应性综合症包括：动员、阻抗、衰竭 躯体性压力源、社会性压力源、心理性压力源、文化性压力源 情感的分类 道德感、理智感、美感 情绪的生理机制 情绪的脑中枢机制 下丘脑位于丘脑下部，主管快乐和痛苦 网状结构位于脑干，维持大脑皮层的觉醒状态 大脑要经过网状结构向下发送信息，引起情绪的外部表现 外周神经系统接收信息，经过网状结构向上传送信息引起大脑皮层的激活状态 边缘系统，边缘系统的杏仁核是愤怒、恐惧的中枢 大脑两半球 情绪的认知方面右半球起更大作用 情绪体验方面左半球负责积极的情绪体验，右半球负责消极的情绪体验 情绪的外周神经机制 情绪和植物性神经系统的关联 交感神经系统、副交感神经系统 分泌系统、躯体神经系统 情绪的理论 情绪发展的角度看 早期理论 早期的生理学理论 詹姆斯-兰格的情绪理论（情绪的外周理论） 强调生理唤醒在情绪产生中的作用，生理因素是第一位的 刺激作用于感觉器官引起身体的变化，对生理变化的知觉就是情绪，先有生理变化才有情绪 评价： 合理：看到了情绪与机体变化的直接关系，强调了植物性神经系统在情绪生产中的作用 不合理：片面强调植物性神经系统的作用，忽视了植物性神经的调节、控制作用 坎农-巴德学说 坎农认为情绪的中枢在中枢神经系统的丘脑，丘脑把信息传导到大脑，大脑知觉刺激的性质，然后产生情绪体验 生理变化与情绪同时产生 评价： 优点：注意到了中枢神经系统在情绪产生中的作用 缺点：事实上这种观点不准确（实验证明） 早期的生理学理论都强调生理变化在情绪产生中的作用 认知理论 强调刺激情境的认知是情绪产生的重要因素 阿诺德的评定-兴奋学说 情境——评估——情绪 具体过程：感受器 -&gt; 丘脑 -&gt; 大脑皮层（评定、评估 -&gt; 态度）-&gt; 丘脑的交感神经 -&gt; 内脏、血管 -&gt; 身体变化的感觉 -&gt; 反馈到大脑皮层 评价 强调了生理因素 + 认知因素 强调了环境的、认知的、行为的等多个因素在情绪产生中的作用，但认知因素是最重要的 情绪认知理论的先驱 沙赫特和辛格的情绪二因素理论 两个因素 个体必须体验到高度的生理唤醒 个体必须对生理唤醒的变化进行认知解释 情绪是对生理唤醒的进行特殊的认知解释后产生的 拉扎勒斯的认知评价理论 个体对环境事件知觉到有益或者有害，是人与环境相互作用的产物（性质 -&gt; 情绪） 强调了情绪活动一定要有认知评价的参与（有益/有害） 人对环境不断作出评价： 初评价（刺激事件是否与自己有利害关系） 次评价（调节控制自己的行为反应） 再评价（评价情绪和行为反应的有效性和适用性，反馈性行为） 没有涉及生理唤醒的因素 情绪认知理论的集大成者 动机分化理论 前面强调情绪的起源和发生，忽略了情绪的作用、功能 汤姆金斯-伊扎德的动机分化理论 核心观点： 情绪和人格系统 人格系统 = 体内平衡、内驱力、情绪、知觉、认知、动作系统 六个系统相对独立，但互相作用 情绪是人格系统的动力核心，是基本的动力系统 情绪系统及其功能 基本的情绪：特定的神经基础、特定的面部肌肉运动模式、可以区分的主观的体验 复合的情绪：基本情绪的混合 情绪系统包含神经生理、表情行为和情感体验三个子系统 情绪产生涉及广泛的神经结构 表情包括神经肌肉和感觉反馈 情感体验由躯体和脸部的活动模式的反馈信号进入意识状态而形成 情绪激活与调节 四种基本过程： 生物遗传——神经内分泌，直接激活情绪体验，并影响以下三个过程 感觉反馈，肌肉活动引起的反馈信息进入边缘皮层去区，使情绪达到意识水平，产生情绪体验 情感激活过程，一种情绪可以影响另外一种情绪 认知激活过程 ，评价、比较等认知活动可以激活情绪 情绪的调节 情绪智力：体现一个人情绪调节能力的高低 1993年定义：区分自己和他人情绪的能力；调节自己和他人情绪的能力；运用情绪信息引导情绪的能力 1995年定义：认识自身情绪的能力；认识他人情绪的能力；妥善管理情绪的能力；自我激励的能力；人际关系管理的能力 调节消极情绪的方法 改变不合理的认知方式 非此即彼，是一种绝对化的认知方式 以偏概全，把一个消极的时间看作永久失败的象征 选择性的过滤，专挑事物的消极方面念念不忘 贬义积极的事物，对这种事物持否认的态度 改变的方法 从积极的方面考虑问题 宣泄 直接宣泄：直接宣泄到这个人身上，但容易对人造成身心损害 间接宣泄：打球喝酒睡大觉！ 转移，转移注意力 自慰，酸葡萄心理 升华，把情绪所激发的力量引导到对自己、对他人有益的方面 能力 人格 人格的概念 概念 比较稳定的，经常能影响人的行为，并使他和别人有所区别的心理特点的总和 是一个复杂的结构系统，包括多种成分如气质、性格、认知风格、自我调控等 特点 统合性：人格是由多种成分构成的一个有机整体，具有内在的一致性，受到自我意识的调控 独特性：人格是在遗传、环境、教育等先天后天因素的交互作用下形成的 稳定性：人格一旦形成后在一定时间内是比较稳定的，不容易改变 功能性：人格可以决定一个人的生活方式甚至命运 成分/结构 气质：表现心理活动的强度、速度、灵活性、指向性等方面的心理特征 分类（体液学） 多血质：情感丰富、外露、思维敏捷、活泼好动、善于交往；缺乏耐心和毅力、稳定性差（时迁） 粘液质：情绪平稳、思维灵活性差；稳重踏实、自制能力强、主动性差、行动比较迟缓（唐僧） 胆汁质：情绪体验很强、思维灵活、精力旺盛、直率；粗枝大叶、鲁莽、感情用事（张飞李逵） 抑郁质：情绪体验深刻、思维敏锐、想象力丰富、多愁善感、优柔寡断 生理基础：人的高级神经活动类型在心理和行为的表现（所以不容易改变） 高级神经活动即兴奋过程和抑制过程的三个基本特性 强度：大脑皮层神经细胞工作能力的标志 平衡性：兴奋过程和抑制过程的相对的力量 灵活性：兴奋过程和抑制过程相互转化的速度 不可遏制型：强、不平衡 ———— 胆汁质 活泼型：强、平衡、灵活 ———— 多血质 安静型：强、平衡、不灵活 ———— 粘液质 抑制型：弱、x、x ———— 抑郁质 气质调查问卷 性格：与社会评价密切相关的人格特征，具有道德评价的含义 性格受社会环境影响很大，比气质较容易发生改变 表现人们对现实和周围世界的态度，表现在人们的行为举止之中 性格有好坏之分 认知风格：个人偏爱使用的认知方式（在认知活动过程中表现出来的不同特点） 认知能力和认知风格不同 能力指顺利完成某种活动的心理条件、现有的水平或个体的潜力；风格指偏爱使用的方式 能力指人们能够达到的最高行为；风格指人们的典型行为 能力是单级变量，有好坏高低之分；风格没有 种类 根据人对外界环境依赖程度进行划分 场独立型：信息加工主要依靠内在参照/自我参照，心里分化水平较高，依据内在标准处理问题 场依存型：对外在参照依赖性大，自我分化低，受周围环境和他人的影响较大 测量方式？镶嵌图形测验 根据思考或解决问题过程中的速度&amp;准确率 快-正确型 冲动型：快，容易出错 沉思型：慢，准确率高 慢-非正确型 测量方式？熟悉图形匹配测验 同时性加工和即时性加工 即时性加工：一步一步分析问题，每个步骤只考虑一种假设，提出的假设在时间上有先后顺序 同时性加工：宽视野的方式，考虑多种问题的可能性，发散式思维 自我调控：对人格各种成分进行调控，保证人格的完整和统一 包含三个子系统 自我认知：对自己的洞察和理解，学会正确的、实事求是的评价自己、 自我体验：伴随自我认知产生的内心的情感体验 自我控制：自我意识在行为上的表现，是实现自我意识调节的最高环节 人格理论 关于人格的结构和功能的阐述，不同的人格理论侧重探讨的问题不同 特质理论 强调人格是由哪些特质或成分组成的，人格特质和行为的关系 特质：指持久而稳定的行为倾向，是人格的有效组成成分，是测评人格的基本单位（谦虚、认真） 主要观点：人格的特质是人们共有的，但是在量的方面存在差异，因此表现出不同的人格 奥尔波特的特质理论：主要包括共同特质和个人特质 共同特质：大多数人共有的相同特质（一定的文化背景下大多数人共有的特质） 个人特质：个体身上比较独特他特质，可分为： 首要特质：一个人最典型的、最有概括性的特质，影响人的方方面面；几乎会影响到个体行为的各个方面； 中心特质：构成个体独特性的几个重要特质 次要特质：不太重要的特质 卡特尔的人格特质理论：用因素分析的方法对人格特质进行分析 因素分析：将多个实测变量简化为少数几个不相关变量的多元统计分析方法（相关的概念） 表面特质：从外部行为中可以直接观察到的特质 根源特质：制约表面通知的一种潜在基础，是构成人格的基本特质，是构成人格的最重要的组成部分 卡特尔认为有16种最基本的根源特质（卡特尔16种人格测验量表） 现代人格特质理论 五因素理论（开放性、责任心、外倾性、宜人性、神经质/情绪稳定性） 七因素理论（正负情绪性、正负效价、可靠性、宜人性、因习性） 类型理论：描述一类人和另一类人的心理差异，根据一定标准把人划分为几种类型，一个人只属于其中的某一个类型（内向&amp;外向） 类型理论划分方法 A型人格和B型人格 A型人格 性格急躁、缺乏耐性；成就欲望高，上进心强，有苦干精神；有时间紧迫感，竞争意识强；动作敏捷，说话快，生活处于紧张状态 社会适应性相对较差，属于不安定性的人；在处理应激事件时在生理上容易激动，不利于身心健康 B型人格 性情温和，举止比较稳当；对工作生活的满足度较高；喜欢慢节奏的生活；可以胜任需要耐心和谨慎思考的工作 内向人格和外向人格（荣格）：根据心里倾向性进行划分 内向人格：心理倾向倾向于内。经常进行自我剖析，做事谨慎、深思熟虑、交往面窄、有时候会出现使用方面的困难 外向人格：注重外部世界，心理活动指向与外，独立自主、善于交往、行动敏捷 特质理论和类型理论的区别 个体之间的差异；群体间的人格差异 描述人格量的差异；描述人格质的差异 通过心理测量来评定；通过观察就可以获得 艾森克的整合理论（试图整合特质理论和类型理论） 把人格特质分为三个基本的人格纬度（三因素模型）：内外倾、神经质、精神质 分成可以按照等级排列的不同单元，基本的结构包括：特殊性反应水平、习惯化反应水平、特质水平、类型水平 精神动力学理论 人格内部的作用过程和人格发展的动力 弗洛伊德的人格发展阶段理论 强调人格是由多种力量相互作用的动力系统，在该系统中，有一种作用对人格发展起着重要作用 以性心理为主线的人格发展阶段理论 以泛性论为基础，强调性本能的冲动对人格发展的重要作用 性本能在不同年龄阶段有不同的区域，即性敏感区 把人格发展分为五个阶段 口腔期（0-1岁）：性敏感区主要在口腔，儿童把自我和现实环境区别开来，产生自我，冲突来源于断奶 肛门期（1-3岁）：性敏感区在肛门，冲突来源于父母的排便训练和儿童的自我排便 生殖器时期（3-6岁）：性敏感区在生殖器，通过抚摸等获得满足； 儿童产生对父母的情绪冲突（俄狄浦斯情节、艾利克斯情节）； 在解决恋父恋母情结的过程中，儿童获得了男性和女性的性格和行为特征，将父母的道德观念、社会态度内化为自己的东西，从而形成超我 潜伏期（6-12岁）：性的兴趣被学习知识等取代，在学习中自我和超我得到更大发展，这时男女之间的关系变得逐渐疏远 生殖器时期（13岁以后）：性敏感区是生殖器，开始对异性感兴趣，逐渐摆脱对父母的依赖 儿童发展的首要任务是解决前一阶段的冲突；成年人的人格受到早期的影响非常大 评价： 贡献：有一定道理，提出早期经验对人格形成的影响；提出婴儿喂养和大小便的训练对人格形成的影响偶一定道理 局限：认为6-12岁这一时期对人格发展不起重要作用；概念模糊，很难被科学的验证和评价 行为主义 强调外部环境 学习等因素对人格形成和发展的作用 人本主义 关注个人感受和主观体验，以及成长潜能等方面对人格发展的作用 人格的测量 自陈式量表法 由一系列问题组成，每个问题陈述一种行为，个人按照自己的真实情况来回答问题 举例 明尼苏达多项人格测验：10个临床量表+4个效度量表 卡特尔人格因素测量量表（16PF） 艾森克人格问卷：分为四个分量表：内外倾、神经质、精神质、效度量表 加州心理调查量表 评价 优点：题目数固定，内容具体，施策简单，计分方便 缺点： 测验内容有的是情绪状态方面，对某一问题的答案常常发生变化 反应的偏向受社会赞许现象的影响 测量结果的可靠程度受到回答者认真程度的影响 投射测验 投射：指把个人的思想态度情感情绪等不自觉地反应于外界事物或他人的心理过程（以己度人） 基本假设：在测验过程中给出一些模棱两可的图片，要求人们说出自己的想法。相对于无结构、没有明确内容的刺激，本身并不含有特殊的意义，但人们对图片的反应有特殊的意义，可以折射出人格的一些特征。主试对被试的反应进行分析来推断其人格特征 举例 罗夏墨迹实验：墨迹图片，要求被试说出看到什么，主试进行提问 主体统觉测验 评价 优点：测量结果真实 缺点： 评分缺乏客观标准 测验结果难以解释 对特定行为不能提供较好的预测 需要花费大量的时间 需要进行专门训练 情境测验 主试设立某种情境，在该情境中观察被试的反应，通过反应来推测人的某些人格特征 举例 性格的教育测验：通常用于教育评价和人事的选拔 情境压力测验：无领导小组讨论 自我概念测验：形容词列表法；Q分类法 人格的成因 遗传 生物的遗传因素影响生物特征 随着人格特质不同而不同 环境因素 社会文化因素 家庭环境因素 学校教育因素","categories":[],"tags":[]},{"title":"Test","slug":"Test","date":"2025-03-31T17:26:00.000Z","updated":"2025-04-01T03:41:00.000Z","comments":true,"path":"Test/","link":"","permalink":"https://jiahaofang.github.io/Test/","excerpt":"","text":"","categories":[],"tags":[]},{"title":"Notion-Hexo 的 Elog 配置详解","slug":"Notion-Hexo 的 Elog 配置详解","date":"2025-03-31T15:35:00.000Z","updated":"2025-03-31T15:35:00.000Z","comments":true,"path":"/notion-notice/","link":"","permalink":"https://jiahaofang.github.io/notion-notice/","excerpt":"前言","text":"前言 在使用 Elog 同步Notion 上的文档时，因为是将富文本向下转成 markdown，会有很多样式损失。这是由于 markdown 样式集合＜ Notion 样式集合。所以在 Notion 上书写时，得按照 markdown 支持的样式进行写作。 可以在这里 看到 Notion 文档被导出为 markdown 时的样式损失程度 如果你不能接受样式损失，可能 markdown 并不适合你，隔壁 NotionNext 可能更适合你搭建博客。 Notion 格式注意点 不要使用 markdown 不支持的样式/语法 例如字体颜色、多级折叠块、书签、数据库、嵌入等。导出为 markdown 都不能正常展示。 适当使用 markdown 形式的超链接 在文档中使用markdown 形式的超链接可以解决部分路由问题，例如链接Notion文档的超链接会被自动处理为非完整路径，或者手动链接到某个相对路由，可以使用以下方式解决 text12// 使用[]() markdown 超链接语法点击 [下一篇](/notion/deploy-platform) 继续配置部署平台 请勿上传视频、文件到 Notion 文档 Elog 还暂不支持将Notion 中的视频、文件暂不支持上传到图床。如果下载到本地，短期内能访问，但因为 notion 的链接具有时效性，一般是一个小时，之后就不能查看了。 Elog 配置详解 参考Elog 文档，本博客的 Elog 的配置如下： 12345678910111213141516171819202122232425262728293031module.exports = &#123; write: &#123; platform: &#x27;notion&#x27;, notion: &#123; token: process.env.NOTION_TOKEN, databaseId: process.env.NOTION_DATABASE_ID, filter: &#123; property: &#x27;status&#x27;, select: &#123; equals: &#x27;已发布&#x27; &#125;&#125; &#125; &#125;, deploy: &#123; platform: &#x27;local&#x27;, local: &#123; outputDir: &#x27;./source/_posts&#x27;, filename: &#x27;title&#x27;, format: &#x27;markdown&#x27;, frontMatter: &#123; enable: true, include: [&#x27;categories&#x27;, &#x27;tags&#x27;, &#x27;title&#x27;, &#x27;date&#x27;, &#x27;updated&#x27;, &#x27;permalink&#x27;, &#x27;cover&#x27;, &#x27;description&#x27;] &#125;, formatExt: &#x27;./format-image.js&#x27;, &#125; &#125;, image: &#123; enable: true, platform: &#x27;local&#x27;, local: &#123; outputDir: &#x27;./source/images&#x27;, prefixKey: &#x27;/images&#x27; &#125; &#125;,&#125; Notion 配置 根据 Hexo 的 FrontMatter 配置文档，和 Butterfly主题的 FrontMatter 配置文档，可以将需要的参数作为 notion 数据库的字段来设置。一般来说，主题的 FrontMatter 为 Hexo在一些基础字段是共用的。 permalink为文档的永久链接，例如https://notion-hexo.vercel.app/notion-hexo/，注意记得在结尾加上/ categories为文档的分类 tags 为文档的标签 description为主题配置中可选的文档描述 12345notion: &#123; token: process.env.NOTION_TOKEN, databaseId: process.env.NOTION_DATABASE_ID, filter: &#123; property: &#x27;status&#x27;, select: &#123; equals: &#x27;已发布&#x27; &#125;&#125;,&#125; token为 Notion Token，可从此处获取 databaseId为数据库的 ID，可从此处获取 filter表示 Elog 将下载 notion 数据库属性为status=已发布的文档 本地配置 12345678910local: &#123; outputDir: &#x27;./source/_posts&#x27;, filename: &#x27;title&#x27;, format: &#x27;markdown&#x27;, frontMatter: &#123; enable: true, include: [&#x27;categories&#x27;, &#x27;tags&#x27;, &#x27;title&#x27;, &#x27;date&#x27;, &#x27;updated&#x27;, &#x27;permalink&#x27;, &#x27;cover&#x27;, &#x27;description&#x27;] &#125;, formatExt: &#x27;./format-image.js&#x27;,&#125; outputDir表示文档的存放位置为项目根目录下的source/_posts文件夹中 filename表示文档将以数据库的 title 字段命名，也就是文档名 format表示文档将以 markdown 的形式保存 frontMatter.enable表示在 markdown 文档开头添加 Front Matter frontMatter.include表示只输出数组中存在的字段，数据库的其他字段忽略 formatExt=./format-image.js表示将使用自定义文档插件，插件路径为项目根目录下的format-image.js文件 format-image.js 该文档插件的作用就是将 notion 文档最上面的封面图 cover，也下载到本地，并替换为本地图片链接 1234567891011121314151617181920212223242526const &#123; matterMarkdownAdapter &#125; = require(&#x27;@elog/cli&#x27;)/** * 自定义文档插件 * @param &#123;DocDetail&#125; doc doc的类型定义为 DocDetail * @param &#123;ImageClient&#125; imageClient 图床下载器 * @return &#123;Promise&lt;DocDetail&gt;&#125; 返回处理后的文档对象 */const format = async (doc, imageClient) =&gt; &#123; const cover = doc.properties.cover if (imageClient) &#123; // 只有启用图床平台image.enable=true时，imageClient才能用，否则请自行实现图片上传 const url = await imageClient.uploadImageFromUrl(cover, doc) // cover链接替换为本地图片 doc.properties.cover = url &#125; // 将文档内容格式化为带有 Front Matter 的 markdown doc.body = matterMarkdownAdapter(doc); // 返回整个文档对象 return doc;&#125;;module.exports = &#123; // 必须要暴露此方法 format,&#125;; 图床配置 1234local: &#123; outputDir: &#x27;./source/images&#x27;, prefixKey: &#x27;/images&#x27;&#125; outputDir表示图片的存放位置为项目根目录下的source/images文件夹中 prefixKey=/images表示图片的统一前缀为/images，因为 Hexo 会将source/images文件夹视为静态资源根目录，统一将图片放在这里，并指定图片前缀，Hexo 才能找到此图片 更多 Elog 配置详情，请阅读 Elog 文档","categories":[{"name":"Elog-Notion","slug":"Elog-Notion","permalink":"https://jiahaofang.github.io/categories/Elog-Notion/"}],"tags":[{"name":"notion","slug":"notion","permalink":"https://jiahaofang.github.io/tags/notion/"},{"name":"elog","slug":"elog","permalink":"https://jiahaofang.github.io/tags/elog/"}]},{"title":"Notion示例文章","slug":"Notion示例文章","date":"2025-03-31T15:35:00.000Z","updated":"2025-03-31T15:35:00.000Z","comments":true,"path":"/notion-example/","link":"","permalink":"https://jiahaofang.github.io/notion-example/","excerpt":"Notion-Markdown","text":"Notion-Markdown Notion示例文章源地址 行内样式 加粗 斜体 下划线 删除线 行内代码 const a = 123 行内公式，在Vitepress会报错，不做演示 红色的文字 蓝色的文字背景 绿色的块背景 Basic block（基本块） Notion示例文章的子页面 Notion示例文章的子页面 表格标题 备注 测试1 啊大大 测试2 const a = 123 无序列表 有序列表：事物按规律变化，也有一种不可避免的性质．这种性质就叫做必然性 事物的必然性，是事物本身的性质（我们反对宿命论的是其认为这一切是受神明的支配，而不是反对事物发展中存在的不可避免的性质的事实） 第三级别列表 第三级别列表 其决定于它自己本身发展的情况和周围的条件 第三级别列表 第三级别列表 折叠块：点击展开【一级】 点击展开【二级】 点击展开【三级】 内容文本 123 引用块 引用换行 引用换行 引用 2 引用 2 换行 👏 标注文本：Elog 0.4.0-beta.7 发布了！ 开放式跨平台博客解决方案，随意组合写作平台和部署平台 帮助导航👇 ❓ Elog能干什么 🚀 快速开始 Media（媒体） bookmark 46_1677164223.mp4 12345pwd=&#x27;123456&#x27;print(f&quot;password=&#123;pwd!r&#125;&quot;)## output:#password=&#x27;123456&#x27; example.txt DataBase（数据库） 数据库 AI block API不支持，会报错Block type ai_block is not supported via the API. Advanced block（高级块） f([1+{x,y}(xy+yx)(u+1)+a]3/2)(行标)f\\left(\\left[\\frac{1+\\{x, y\\}}{\\left(\\frac{x}{y}+\\frac{y}{x}\\right)(u+1)}+a\\right]^{3 / 2}\\right)\\tag{行标} f⎝⎜⎛​⎣⎡​(yx​+xy​)(u+1)1+{x,y}​+a⎦⎤​3/2⎠⎟⎞​(行标) Notion示例文章的同步块 折叠一级标题 ## 折叠二级标题 折叠内容 两列分栏（左） [ ] 左侧书写 两列分栏（右） [ ] 右侧书写 123graph LR;Mermaid思维导图--&gt;思维导图Mermaid思维导图--&gt;研发 @Anonymous Untitled 2023-04-26 🚀🔥🐸 Embeds（嵌入） 嵌入网页 embed","categories":[{"name":"Elog-Notion","slug":"Elog-Notion","permalink":"https://jiahaofang.github.io/categories/Elog-Notion/"}],"tags":[{"name":"notion","slug":"notion","permalink":"https://jiahaofang.github.io/tags/notion/"}]},{"title":"Notion + Hexo + GitHub Actions + Vercel 博客解决方案","slug":"Notion + Hexo + GitHub Actions + Vercel 博客解决方案","date":"2025-03-31T15:35:00.000Z","updated":"2025-04-01T02:33:00.000Z","comments":true,"path":"/notion-hexo/","link":"","permalink":"https://jiahaofang.github.io/notion-hexo/","excerpt":"博客工具","text":"博客工具 写作平台：Notion 博客平台：Hexo 博客主题：Butterfly@4.10.0 博客文档同步：Elog 部署平台：Vercel 博客仓库：https://github.com/LetTTGACO/notion-hexo 博客搭建指南 Fork模板仓库 点击 Fork 该模板仓库到个人 Github 账号仓库下并 clone 到本地 安装依赖 在项目根目录下运行命令安装依赖 1npm install 新建 Elog 本地调试文件 在项目根目录中复制.elog.example.env文件并改名为.elog.env，此文件将用于本地同步Notion 文档 配置 Notion 关键信息 按照文档提示配置 Notion 并获取 token 和 databaseId，在本地.elog.env中写入 text12NOTION_TOKEN=获取的tokenNOTION_DATABASE_ID=获取的databaseId 本地调试 在项目根目录运行同步命令 1npm run sync:local 启动 Hexo 在项目根目录运行hexo启动命令，会自动打开本地博客 1npm run server 配置 Hexo 博客 根据 Hexo 文档和 Butterfly 主题配置文档，配置你的博客直到你满意为主，你也可以换别的主题，这里不做演示 提交代码到 github 本地访问没问题直接提交所有文件到 Github 仓库即可 部署到 Vercel 注册 Vercel 账号并绑定 Github，在 Vercel 导入 该项目，Vercel 会自动识别出该 Hexo 项目，不需要改动，直接选择 Deploy 部署。部署完成会有一个 Vercel 临时域名，你也可以绑定自己的域名。 配置 Github Actions 权限 在 Github 仓库的设置中找到 Actions-General，打开流水线写入权限Workflow permissions 配置环境变量 在本地运行时，用的是.elog.env文件中定义的 Notion 账号信息，而在 Github Actions 时，需要提前配置环境变量。 在 Github 仓库的设置中找到 Secrets and variables，新增仓库的环境变量NOTION_DATABASE_ID和NOTION_TOKEN和.elog.env保持一致即可 自动化部署 当在 Notion 中改动文档后，手动/自动触发 Github Actions流水线，会重新从 Notion 增量拉取文档，自动提交代码到 Github 仓库。 Vercel 会实时监测仓库代码，当有新的提交时都会重新部署博客。如此就实现了自动化部署博客。 整个流程的关键点就在于：如何手动/自动触发 Github Actions 在项目.github/workflows/sync.yaml中已经配置了外部 API 触发 Github Actions 事件，所以只需要调用 API 触发流水线即可。 手动触发 为了方便，这里提供一个部署在 Vercel 的免费公用的ServerlessAPI，只需要配置好 URL 参数并浏览器访问即可触发流水线 1https://serverless-api-elog.vercel.app/api/github?user=xxx&amp;repo=xxx&amp;event_type=deploy&amp;token=xxx 自动触发 可在 Notion 中结合 Slack 触发，参考教程，这里就不做进一步演示了 自定义 Elog 配置 如果想自定义 Elog 配置，可访问 Elog 文档 博客示例 示例仓库：https://github.com/LetTTGACO/notion-hexo 博客示例地址：https://notion-hexo.vercel.app","categories":[{"name":"博客折腾手册","slug":"博客折腾手册","permalink":"https://jiahaofang.github.io/categories/%E5%8D%9A%E5%AE%A2%E6%8A%98%E8%85%BE%E6%89%8B%E5%86%8C/"}],"tags":[{"name":"notion","slug":"notion","permalink":"https://jiahaofang.github.io/tags/notion/"},{"name":"elog","slug":"elog","permalink":"https://jiahaofang.github.io/tags/elog/"},{"name":"hexo","slug":"hexo","permalink":"https://jiahaofang.github.io/tags/hexo/"},{"name":"blog","slug":"blog","permalink":"https://jiahaofang.github.io/tags/blog/"}]},{"title":"雷达自动升温控制器设计","slug":"雷达自动升温控制器设计","date":"2022-02-22T08:37:37.000Z","updated":"2025-04-01T01:56:25.982Z","comments":true,"path":"雷达自动升温控制器设计/","link":"","permalink":"https://jiahaofang.github.io/%E9%9B%B7%E8%BE%BE%E8%87%AA%E5%8A%A8%E5%8D%87%E6%B8%A9%E6%8E%A7%E5%88%B6%E5%99%A8%E8%AE%BE%E8%AE%A1/","excerpt":"1 控制器","text":"1 控制器 1.1 预设升温曲线 期望温度输入曲线为一次函数曲线 控制时间为40分钟左右，控制温度幅度约为40℃到80℃． 曲线斜率 k=80C−40C40min⁡=1C/min⁡k=\\frac{80C-40C}{40\\min}=1 C/\\min k=40min80C−40C​=1C/min 根据后续实验，该斜率值修正为1.1℃/min，后续记该斜率为slope = 1.1℃． 截距b=0b=0b=0，即在接管控制之后期望温度曲线为正比例函数． 控制方式 雷达启动初期，可以利用雷达自热升温． 当雷达自热升温曲线较为平缓后，控制器接管控制． 1.2 设置输出 通过串口通讯程序(driver)实现控制器与外部硬件(风扇)的通讯． 根据已有驱动代码，driver的接口为占空比，应将控制器输出转化为占空比输出． 通过继电器对风扇进行通断控制，模拟PWM输出，实现输出功率的控制． 1.3 控制对象 雷达的温度传感器在雷达内部，外界加热通过热风作用在雷达的金属外壳上，热量传递需要时间，并且系统惯性较大． 将该温度控制对象抽象为一个带有大时滞环节的一阶惯性环节，频域表达式： G(s)=Gp(s)⋅e−τs=KTs+1⋅e−τsG(s)=G_p(s)\\cdot e^{-\\tau s}=\\frac K{Ts+1}\\cdot e^{-\\tau s} G(s)=Gp​(s)⋅e−τs=Ts+1K​⋅e−τs 其中τ/T&gt;0.5\\tau/T&gt;0.5τ/T&gt;0.5. 考虑到该对象时域表达式较复杂且各参数与实验环境相关，波动较大，所以不建模，实地测量调参 1.4 控制器设计 采用位置式PD控制，考虑到对象类型，可以采用中间微分反馈方案 中间微分 离散时域表达式： u(k)=Kp⋅e(k)−Kd⋅[y(k)−y(k−1)]u(k)=K_p\\cdot e(k)-K_d \\cdot [y (k)-y(k-1)] u(k)=Kp​⋅e(k)−Kd​⋅[y(k)−y(k−1)] 考虑到该系统需要跟踪单位速度曲线，且为了避免数据波动对微分的影响，时域表达式修正为： u(k)=Kp⋅e(k)−Kd⋅[(y(k)−y(k−T))1min⁡T−target_slope]u(k)=K_p\\cdot e(k)-K_d \\cdot [(y (k)-y(k-T))\\frac{1\\min}{T}-target\\_slope] u(k)=Kp​⋅e(k)−Kd​⋅[(y(k)−y(k−T))T1min​−target_slope] 或写作： u(k)=Kp⋅e(k)−Kd⋅[slope−target_slope]u(k)=K_p\\cdot e(k)-K_d \\cdot [slope-target\\_slope] u(k)=Kp​⋅e(k)−Kd​⋅[slope−target_slope] ​ 其中target_slope=1.1target\\_slope=1.1target_slope=1.1为预设曲线的斜率，T为一个微分时间间隔． 设置控制器工作频率为三秒钟，保证控制较为平滑 1.5 参数设置 比例部分 经过实际测量，系统处于稳态时，实际温度与期望温度之差保持在±1℃． 当误差为0.5℃时，使控制器的输出为100％ max[e(k)]⋅Kp−0=output⇓ 0.5⋅KP=100% ⇓ Kp=2max[e(k)]\\cdot K_p-0= output \\\\ \\Downarrow\\\\ 0.5 \\cdot K_P=100\\% \\\\ \\Downarrow \\\\ K_p=2 max[e(k)]⋅Kp​−0=output⇓ 0.5⋅KP​=100% ⇓ Kp​=2 可以得出Kp的值在2左右． 微分部分 考虑到系统特性，希望微分部分作用效果较强，能够提前预测系统接下来的温度走向． 经过实际测量，控制器开启后的升温曲线斜率与期望斜率之差保持在±1℃/min之内，当升温较为稳定时，斜率之差保持在正负0.5℃/min之内．为了让控制器对温度斜率误差较敏感．令斜率误差为0.5℃/min时（假定比例部分误差为０）控制器输出为50％： 0−max[slope−target_slope]⋅Kd=output⇓0.5⋅Kd=50%⇓Kd=10-max[slope-target\\_slope]\\cdot K_d=output \\\\\\Downarrow\\\\ 0.5\\cdot K_d=50\\% \\\\\\Downarrow\\\\ K_d = 1 0−max[slope−target_slope]⋅Kd​=output⇓0.5⋅Kd​=50%⇓Kd​=1 可以得出Kd的值在1左右 另外，考虑到系统跟踪速度曲线较为困难，微分部分仅在升温曲线斜率小于期望斜率时开启． outputd={(target_slope－slope)⋅Kd,slope&lt;target_slope0,slope&gt;=target_slopeoutput_d= \\begin{cases} (target\\_slope－slope)\\cdot K_d&amp;,slope&lt;target\\_slope \\\\ 0&amp;,slope&gt;=target\\_slope \\end{cases} outputd​={(target_slope－slope)⋅Kd​0​,slope&lt;target_slope,slope&gt;=target_slope​ 微分周期问题 微分周期应该尽量小，以尽量逼近实际升温曲线斜率 由于温度输入为离散信号，且部分雷达温度传感器精度较低，微分周期应该大于一定值以避免误差 目前暂定微分周期为15s，该数据适用于16线，32线，128线雷达．但由于MEMS和bpearl雷达的传感器温度较低，可将该周期值修正为30-60s T={15s,Lidar−16,32,12830s−60s,Lidar−mems,bpT= \\begin{cases} 15s&amp;,Lidar-16,32,128 \\\\ 30s-60s &amp;,Lidar-mems,bp \\end{cases} T={15s30s−60s​,Lidar−16,32,128,Lidar−mems,bp​","categories":[{"name":"笔记","slug":"笔记","permalink":"https://jiahaofang.github.io/categories/%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"pid","slug":"pid","permalink":"https://jiahaofang.github.io/tags/pid/"},{"name":"control theory","slug":"control-theory","permalink":"https://jiahaofang.github.io/tags/control-theory/"}]},{"title":"Hexo相关记录","slug":"Hexo相关记录","date":"2022-02-22T05:22:06.000Z","updated":"2025-04-01T01:56:25.980Z","comments":true,"path":"Hexo相关记录/","link":"","permalink":"https://jiahaofang.github.io/Hexo%E7%9B%B8%E5%85%B3%E8%AE%B0%E5%BD%95/","excerpt":"使用git分支保存源码","text":"使用git分支保存源码 拉取分支 因Github Page要求使用master分支作为发布网站的源代码，我们只能用master分支来保存hexo生成的静态网页，对于博客源码，可以新建一个source分支来存储。在github上打开Pages对应的仓库，也就是以”username.github.io”命名的仓库，然后建立一个source分支，仓库的默认分支改为保存源码的source分支，这样通过git clone拉取的就是source分支代码了。 1git clone https://github.com/JiaHaoFang/JiaHaoFang.github.io.git 配置环境 1234# 安装hexonpm install hexo# git支持npm install hexo-deployer-git -save 添加next主题配置 1git clone https://github.com/theme-next/hexo-theme-next.git themes/next 显示摘要 12# 显示摘要npm install hexo-excerpt --save 用typora写作 markdown语法支持 使用typora作为语法编辑器，使用插件使网页能够支持markdown的编辑格式 安装库 123# markdown语法支持npm uni hexo-renderer-marked --savenpm i @upupming/hexo-renderer-markdown-it-plus --save 使用 在hexo站点配置文件_config.yml中添加如下配置，详细配置: 1234567891011# Markdown configmarkdown_it_plus: highlight: true html: true xhtmlOut: true breaks: true langPrefix: linkify: true typographer: quotes: “”‘’ pre_class: highlight 图片链接 为了与typora写作，使网页能够直接渲染typora编辑的markdown文档，需要在typora中设置图片保存在./$${filename}下，安装该插件即可（该插件md写着是为了与typora共同使用而开发） 12# 图片链接npm install hexo-image-link --save 文章置顶 123# 添加文章置顶功能，未使用npm uninstall hexo-generator-index --savenpm install hexo-generator-index-pin-top --save 安装后在文章顶部增加字段top: true即可 页脚增加网站运行时间统计(NexT8.0 以下) 找到 \\themes\\next\\layout\\_partials\\ 下面的 footer.swig 文件 在合适的位置添加下面代码（通过运行调试，查看运行时间出现的位置）（45行） 12345678910111213141516171819202122232425262728293031323334353637383940&lt;!--添加运行时间--&gt;&lt;span id=&quot;sitetime&quot;&gt;&lt;/span&gt;&lt;script language=javascript&gt; function siteTime()&#123; window.setTimeout(&quot;siteTime()&quot;, 1000); var seconds = 1000; var minutes = seconds * 60; var hours = minutes * 60; var days = hours * 24; var years = days * 365; var today = new Date(); var todayYear = today.getFullYear(); var todayMonth = today.getMonth()+1; var todayDate = today.getDate(); var todayHour = today.getHours(); var todayMinute = today.getMinutes(); var todaySecond = today.getSeconds(); /* Date.UTC() -- 返回date对象距世界标准时间(UTC)1970年1月1日午夜之间的毫秒数(时间戳) year - 作为date对象的年份，为4位年份值 month - 0-11之间的整数，做为date对象的月份 day - 1-31之间的整数，做为date对象的天数 hours - 0(午夜24点)-23之间的整数，做为date对象的小时数 minutes - 0-59之间的整数，做为date对象的分钟数 seconds - 0-59之间的整数，做为date对象的秒数 microseconds - 0-999之间的整数，做为date对象的毫秒数 */ var t1 = Date.UTC(2022,02,21,13,30,00); //北京时间2018-2-13 00:00:00 var t2 = Date.UTC(todayYear,todayMonth,todayDate,todayHour,todayMinute,todaySecond); var diff = t2-t1; var diffYears = Math.floor(diff/years); var diffDays = Math.floor((diff/days)-diffYears*365); var diffHours = Math.floor((diff-(diffYears*365+diffDays)*days)/hours); var diffMinutes = Math.floor((diff-(diffYears*365+diffDays)*days-diffHours*hours)/minutes); var diffSeconds = Math.floor((diff-(diffYears*365+diffDays)*days-diffHours*hours-diffMinutes*minutes)/seconds); document.getElementById(&quot;sitetime&quot;).innerHTML=&quot; 已运行&quot;+/*diffYears+&quot; 年 &quot;+*/diffDays+&quot; 天 &quot;+diffHours+&quot; 小时 &quot;+diffMinutes+&quot; 分钟 &quot;+diffSeconds+&quot; 秒&quot;; &#125; siteTime();&lt;/script&gt;&lt;!--添加运行时间--&gt; 页脚增加网站运行时间统计(NexT8.0 以上) 找到 themes/next/layout/_partials/footer.njk文件 在末尾加入以下代码 123456789101112131415161718192021&lt;!-- &lt;br /&gt; --&gt;&lt;!-- 网站运行时间的设置 --&gt;&lt;span id=&quot;timeDate&quot;&gt;载入天数...&lt;/span&gt;&lt;!-- &lt;span id=&quot;times&quot;&gt;载入时分秒...&lt;/span&gt; --&gt;&lt;script&gt;var now = new Date();function createtime() &#123; var grt= new Date(&quot;02/21/2022 13:30:00&quot;);//(2022,02,21,13,30,00) now.setTime(now.getTime()+250); days = (now - grt ) / 1000 / 60 / 60 / 24; dnum = Math.floor(days); hours = (now - grt ) / 1000 / 60 / 60 - (24 * dnum); hnum = Math.floor(hours); if(String(hnum).length ==1 )&#123;hnum = &quot;0&quot; + hnum;&#125; minutes = (now - grt ) / 1000 /60 - (24 * 60 * dnum) - (60 * hnum); mnum = Math.floor(minutes); if(String(mnum).length ==1 )&#123;mnum = &quot;0&quot; + mnum;&#125; seconds = (now - grt ) / 1000 - (24 * 60 * 60 * dnum) - (60 * 60 * hnum) - (60 * mnum); snum = Math.round(seconds); if(String(snum).length ==1 )&#123;snum = &quot;0&quot; + snum;&#125; // var times = document.getElementById(&quot;times&quot;).innerHTML = hnum + &quot; 小时 &quot; + mnum + &quot; 分 &quot; + snum + &quot; 秒&quot;; document.getElementById(&quot;timeDate&quot;).innerHTML = &quot;本站已安全运行 &quot;+dnum+&quot; 天 &quot;+hnum + &quot; 小时 &quot; + mnum + &quot; 分 &quot; + snum + &quot; 秒&quot;;&#125;setInterval(&quot;createtime()&quot;,250);&lt;/script&gt; 搜索引擎支持 各搜索引擎网站管理员中心 Google：https://www.google.com/webmasters/tools bing：https://www.bing.com/webmasters/home 向搜索引擎提交站点 以Google为例 修改themes/next/_config.yml文件： 123# Google Webmaster tools verification.# See: https://www.google.com/webmastersgoogle_site_verification: xxxxxxxxxx 提交网站地图 提交网站地图加快索引 安装插件sitemap 1npm install hexo-generator-sitemap –save 在themes/next/_config.yml中修改： 123456789menu:home: / || fa fa-hometags: /tags/ || fa fa-tagscategories: /categories/ || fa fa-tharchives: /archives/ || fa fa-archiveabout: /about/ || fa fa-user#schedule: /schedule/ || fa fa-calendarsitemap: /sitemap.xml || fa fa-sitemap#commonweal: /404/ || fa fa-heartbeat 生成静态网页，上传，然后在对应搜索引擎的webmasters中添加站点地图的地址即可 验证是否被检索 以GitHub Pages为例，新建的GitHub Pages是没有被谷歌检索的。在谷歌搜索栏中输入如下信息进行检索： 1site: jiahaofang.github.io 本地搜索功能 在根目录执行命令 1npm install hexo-generator-searchdb --save 配置 hexo 的_config.yml文件 在文件末尾新增配置项 12345search: path: search.xml field: post format: html limit: 10000 配置 NexT 主题的 _config.yml（根据 next 文档，应为/_config.next.yml） 123# Local searchlocal_search: enable: true","categories":[{"name":"笔记","slug":"笔记","permalink":"https://jiahaofang.github.io/categories/%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"Hexo","slug":"Hexo","permalink":"https://jiahaofang.github.io/tags/Hexo/"},{"name":"git","slug":"git","permalink":"https://jiahaofang.github.io/tags/git/"}]},{"title":"iOS代码发布为组件","slug":"iOS代码发布组件","date":"2022-02-21T09:16:45.000Z","updated":"2025-04-01T01:56:25.982Z","comments":true,"path":"iOS代码发布组件/","link":"","permalink":"https://jiahaofang.github.io/iOS%E4%BB%A3%E7%A0%81%E5%8F%91%E5%B8%83%E7%BB%84%E4%BB%B6/","excerpt":"1 前期准备","text":"1 前期准备 1.1 远程仓库 准备好两个远程仓库，在GitHub上创建即可； 权限建议为public 用来存放源码的仓库，该仓库用来存放自己编写的组件的源码，其应为正确的目录结构，如何模板创建下文详细说； 1https://github.com/JiaHaoFang/SFAPPRealTimeLogCaughter.git 用来存放组件的仓库，相当于xxxRepo、CocoaPods/Spec，是自己私有的组件仓库，用来存放.podspec文件； 1https://github.com/JiaHaoFang/SFPodRepo.git 注：该仓库非必要，可以使用官方仓库，此处为了熟悉流程使用自己创建的仓库 1.2 本地代码 由于该组件为一个完整工程作为组件发布，需要抽离 保证需要发布为组件的工程，其核心功能完整，去耦，能够实现核心功能的抽离 保证编译可通过，同时核心功能具备可移植性 2 本地目录创建 2.1 创建私有Repo目录 在～/.cocoapods/repo中能看到本地有的repo仓库，其中cocoapods为官方仓库，trunk也是官方仓库（历史遗留问题）；xxxRepo为公司私有仓库。 该步骤将创建私人仓库SFRepo，作用类似上文的官方仓库，后续将用来存放个人的组件。 或者也可以选择发布到官方仓库。 命令 1pod repo add SFPod https://github.com/JiaHaoFang/SFPodRepo.git 创建完成之后可通过命令查看目录结构 1open ~/.cocoapods/repos/SFPod 2.2 创建个人组件目录 发布的组件需要按照Cocoapod严格遵守官方给出的目录结构，官方给出了命令可以直接生成模版 1pod lib create SFAPPRealTimeLogCaughter 过程中终端会向我们提出一系列问题，包括开发语言是OC还是Swift，demo程序，测试框架，界面测试。我选择了包含demo程序，没有测试框架. 生成模版后可以使用tree命令查看该文件夹下的目录结构 2.3 编辑模版 在2.2创建的公共模版就是组件的模板，我们需要将我们的代码添加进去将其作为自己的组件 我们需要发布的组件核心功能代码存放在/SFPod/Pod/Classes文件夹中 另外在Example中编写Demo测试自己的组件是否能正常工作，点击.xcworkspace可以作为一个完整工程运行 在写Example的时候，如果修改了Classes中文件的，需要pod install一下，将组件在自己的Demo中更新一下 2.4 编辑.podspec文件 自行Google 3 发布组件 如果上面的步骤完成了，恭喜，完成了一半 3.1 校验 当2中的步骤全部完成，我们可以使用下面的命令检验自己组件代码的合法性（主要是检验.podspec文件） 123456pod lib lint# 只从本地验证你的pod能否通过验证。pod spec lint# 从本地和远程验证你的pod能否通过验证，建议使用这个--allow-warnings# 如何库代码中有警告导致通不过验证。加上这个忽略警告 3.2 提交源码 提交源码到个人仓库 12345git add -agit commit -m &quot;xxx&quot;git pushgit tag 0.1.0git push --tags 3.3 发布组件到个人Repo 使用命令将.podspec文件添加到~/.cocoapods/repos/SFPod中，同时也发布到远程仓库 1pod repo push SFPod SFAPPRealTimeLogCaughter.podspec 执行完该步骤后， ~/.cocoapods/repos/SFPod会新增对应版本的.podspec文件 3.4 查询 搜索组件库 1pod search SFAPPRealTimeLogCaughter 搜索到了说明安装成功 4 使用组件 在Podfile文件新增源 12source &#x27;https://github.com/JiaHaoFang/SFPodRepo.git&#x27;source &#x27;https://github.com/CocoaPods/Specs.git&#x27; 添加pod 1pod &#x27;SFAPPRealTimeLogCaughter&#x27; 上面两项可以合起来写，合不起来。。。 执行 pod install 运行代码 参考资料：https://www.jianshu.com/p/103a6f0bf3a4","categories":[{"name":"笔记","slug":"笔记","permalink":"https://jiahaofang.github.io/categories/%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"iOS","slug":"iOS","permalink":"https://jiahaofang.github.io/tags/iOS/"},{"name":"Cocoapods","slug":"Cocoapods","permalink":"https://jiahaofang.github.io/tags/Cocoapods/"}]}],"categories":[{"name":"Elog-Notion","slug":"Elog-Notion","permalink":"https://jiahaofang.github.io/categories/Elog-Notion/"},{"name":"博客折腾手册","slug":"博客折腾手册","permalink":"https://jiahaofang.github.io/categories/%E5%8D%9A%E5%AE%A2%E6%8A%98%E8%85%BE%E6%89%8B%E5%86%8C/"},{"name":"笔记","slug":"笔记","permalink":"https://jiahaofang.github.io/categories/%E7%AC%94%E8%AE%B0/"}],"tags":[{"name":"notion","slug":"notion","permalink":"https://jiahaofang.github.io/tags/notion/"},{"name":"elog","slug":"elog","permalink":"https://jiahaofang.github.io/tags/elog/"},{"name":"hexo","slug":"hexo","permalink":"https://jiahaofang.github.io/tags/hexo/"},{"name":"blog","slug":"blog","permalink":"https://jiahaofang.github.io/tags/blog/"},{"name":"pid","slug":"pid","permalink":"https://jiahaofang.github.io/tags/pid/"},{"name":"control theory","slug":"control-theory","permalink":"https://jiahaofang.github.io/tags/control-theory/"},{"name":"Hexo","slug":"Hexo","permalink":"https://jiahaofang.github.io/tags/Hexo/"},{"name":"git","slug":"git","permalink":"https://jiahaofang.github.io/tags/git/"},{"name":"iOS","slug":"iOS","permalink":"https://jiahaofang.github.io/tags/iOS/"},{"name":"Cocoapods","slug":"Cocoapods","permalink":"https://jiahaofang.github.io/tags/Cocoapods/"}]}